{
    "lang":                            "fr",
    "title":                           "Générateur de QR Code | accueil",
    "h1title":                         "Générateur de QR Code",
    "err1":                            "Erreur : Impossible de créer le dossier.",
    "err2":                            "Erreur : La correction d'erreur choisie n'est pas correcte.",
    "err3":                            "Erreur : La taille du qr code choisie n'est pas correcte.",
    "err4":                            "Erreur : La marge du qr code choisie n'est pas correcte.",
    "err5":                            "Erreur : La marge est trop grande.",
    "err6":                            "Erreur : Pour utiliser un logo vous devez utiliser un niveau de correction haut.",
    "err7":                            "Erreur : Le logo que vous voulez ajouté doit être parfaitement carré.",
    "qrgenok":                         "QR code généré avec succès.",
    "fillall":                         "Tous les champs du formulaire doivent être remplis.",
    "badcaptcha":                      "Captcha invalide.",
    "badcsrf":                         "Échec de la vérification CSRF. Le formulaire ne peut pas être traité.",
    "titleconsent":                    "Demande de consentement pour stocker les QR Codes.",
    "consentinfo1":                    "En cochant la case ci-dessus, vous nous donnez la permission de stocker localement sur votre pc vos QR Codes pour votre usage personnel.",
    "consentinfo2":                    "Si vous ne souhaitez pas que nous le fassions, vous pourrez toujours générer des QR Codes sans stocker d'historique, le fait d'accepter ne permet que de simplifier votre utilisation de notre service via l'historique.",
    "consentinfo3":                    "Votre vie privée est importante pour nous, et nous vous remercions de nous aider à rendre notre service adapté à vos besoins tout en respectant votre confidentialité.",
    "consentinfo4":                    "Plus d'information ici.",
    "formtxt":                         "Texte ou URL :",
    "formcorrectionlevel":             "Niveau de correction d'erreur :",
    "formcorrectionleveldefault":      "Sélectionnez un niveau de correction",
    "iconsent":                        "Je consens à activer l'historique",
    "inotconsent":                     "Je ne consens pas à activer l'historique",
    "addlogo":                         "Ajmarginselectouter un logo png / jpg :",
    "sizeselect":                      "Taille en pixels :",
    "marginselect":                    "Marge en pixels :",
    "codecaptchatext":                 "Code CAPTCHA :",
    "generatetext":                    "Générer QR Code",
    "downloadqr":                      "Télécharger QR Code",
    "oversizelogo":                    "La taille du logo est trop grande. Limite : 2 Mo.",
    "onlyjpgpng":                      "Seuls les fichiers PNG ou JPG / JPEG sont autorisés.",
    "captchacodetext":                 "Captcha :",
    "h2product":                       "StuQrGenerator",
    "pinfo1":                          "Vous cherchez un moyen simple et efficace de partager des informations importantes en un clin d'œil ? StuQrGenerator le fait pour vous.",
    "pinfo2":                          "Avec sa simplicité d'utilisation et sa polyvalence, notre outil vous permet de créer des QR codes personnalisés en quelques clics.",
    "pinfo3":                          "Imaginez pouvoir transformer instantanément une URL, un texte, des informations de contact ou tout autre contenu pertinent en un QR code pertinent.",
    "pinfo4":                          "StuQrGenerator simplifie ce processus. Il suffit de saisir vos données, de personnaliser votre code selon vos besoins (choix de la correction d'erreur, ajout de logos, sélection de la taille, etc.) et voilà ! En quelques instants, votre code est prêt à être utilisé.",
    "h2explain":                       "Fonctionnement",
    "pexplain1":                       "StuQrGenerator à été réfléchi pour qu'il soit intuitif. Il offre une interface conviviale où vous saisissez les informations que vous souhaitez encoder, sa taille en pixel, le niveau de correction d'erreur souhaité.",
    "pexplain2":                       "Si le niveau de correction est suffisant, il vous sera même possible de personnaliser vos Qr codes en y ajoutant un logo.",
    "pexplain3":                       "Une fois les paramètres définis, StuQrGenerator s'occupe du reste. Il crée votre QR code de manière rapide et fiable, garantissant sa fonctionnalité et sa lisibilité.",
    "pexplain4":                       "Vous obtenez ainsi un code visuel prêt à être partagé sur des supports physiques, des publicités, des événements, des produits, ou tout autre élément nécessitant une interaction rapide et intuitive.",
    "pexplain5":                       "En résumé, StuQrGenerator vous offre un moyen simple, rapide et efficace de transformer vos données en codes visuels interactifs.",
    "pexplain6":                       "Que ce soit pour une campagne marketing, un événement, une gestion de stocks ou simplement pour partager des informations avec facilité, notre outil est conçu pour répondre à vos besoins de manière efficace et professionnelle.",
    "historytitle":                    "Vos générations précédentes :",
    "meetthedeveloper":                "Retrouvez le développeur ici : ",
    "showmodalhistory":                "Activer l'historique des QR codes générés",
    "historicalConditionsTitle":       "Nos conditions d'utilisation de la fonction historique",
    "dearUser":                        "Cher utilisateur,",
    "improveExperience":               "Pour améliorer votre expérience et vous permettre de retrouver facilement les QR Codes que vous avez générés, nous aimerions stocker localement un historique de vos créations. Cela signifie que vous pourrez accéder à votre historique personnel de QR Codes chaque fois que vous utiliserez notre service.",
    "implicationsTitle":               "Qu'est-ce que cela implique ?",
    "quickAccess":                     "Vous aurez un accès rapide à vos QR Codes générés dans le passé.",
    "noDataSharing":                   "Nous ne partagerons jamais ces données avec des tiers sans votre consentement explicite, nous ne vous le demandons pas car nous ne voulons rien partager avec des tiers.",
    "accessFromCurrentDevice":         "Vos QR Codes resteront accessibles uniquement à partir de l'appareil que vous utilisez actuellement.",
    "deletionAfter30Days":             "Les QR Codes de tout le monde sont supprimés au bout de 30 jours dans tous les cas, nous n'en gardons pas l'historique.",
    "titleHistory":                    "Générateur de QR Code | Informations relatives à vos données personnelles",
    "download":                        "Télécharger",
    "seeMore":                         "Voir plus",
    "lng1":                            "en",
    "lng2":                            "de",
    "yourQrCode":                      "Votre Qr Code",


    "altLng1":                         "Utilisez le générateur en Anglais",
    "altLng2":                         "Utilisez le générateur en Allemand",
    "altStuQrLogo":                    "logo de StuQrGenerator",
    "linkUsecase":                     "Utilisez StuQrGenerator pour générer des QR code pointant vers des liens",
    "infosUsecase":                    "Utilisez StuQrGenerator pour générer des QR code d'informations ou de lien informatif",
    "contactUsecase":                  "Utilisez StuQrGenerator pour partager des contacts via le format QR Code",
    "menuUsecase":                     "Utilisez StuQrGenerator pour partager un lien vers le menu de votre restaurant",
    "locationUsecase":                 "Utilisez StuQrGenerator pour partager un emplacement, coordonnées ou liens maps",
    "ticketUsecase":                   "Utilisez StuQrGenerator pour partager un lien vers votre billetterie",
    "wifiUsecase":                     "Utilisez StuQrGenerator pour partager votre wifi",
    "socialUsecase":                   "Utilisez StuQrGenerator pour partager vos réseaux sociaux"
}
