{
    "lang":                            "de",
    "title":                           "QR-Code-Generator | Startseite",
    "h1title":                         "QR-Code-Generator",
    "err1":                            "Fehler: Ordner kann nicht erstellt werden.",
    "err2":                            "Fehler: Die gewählte Fehlerkorrektur ist nicht korrekt.",
    "err3":                            "Fehler: Die ausgewählte QR-Code-Größe ist nicht korrekt.",
    "err4":                            "Fehler: Der ausgewählte QR-Code-Rand ist nicht korrekt.",
    "err5":                            "Fehler: Der Rand ist zu groß.",
    "err6":                            "Fehler: Um ein Logo zu verwenden, muss eine hohe Fehlerkorrektur verwendet werden.",
    "err7":                            "Fehler: Das hinzuzufügende Logo muss perfekt quadratisch sein.",
    "err8":                            "Fehler: Ihr Server verfügt nicht über die erforderliche Imagick-Bibliothek.",
    "err9":                            "Fehler: ",
    "qrgenok":                         "QR-Code erfolgreich generiert.",
    "fillall":                         "Alle Formularfelder müssen ausgefüllt sein.",
    "badcaptcha":                      "Ungültiges Captcha.",
    "badcsrf":                         "CSRF-Prüfung fehlgeschlagen. Das Formular kann nicht verarbeitet werden.",
    "titleconsent":                    "Zustimmung zur Speicherung von QR-Codes anfordern.",
    "consentinfo1":                    "Durch Ankreuzen des obigen Feldes erteilen Sie uns die Erlaubnis, Ihre QR-Codes lokal auf Ihrem PC für Ihren persönlichen Gebrauch zu speichern.",
    "consentinfo2":                    "Wenn Sie dies nicht möchten, können Sie weiterhin QR-Codes generieren, ohne Verlauf zu speichern. Die Zustimmung dient lediglich dazu, Ihre Nutzung unseres Dienstes über den Verlauf zu erleichtern.",
    "consentinfo3":                    "Ihre Privatsphäre ist uns wichtig, und wir danken Ihnen, dass Sie uns dabei helfen, unseren Service an Ihre Bedürfnisse anzupassen und dabei Ihre Privatsphäre zu respektieren.",
    "consentinfo4":                    "Weitere Informationen hier.",
    "formtxt":                         "Text oder URL:",
    "formcorrectionlevel":             "Fehlerkorrekturlevel:",
    "formcorrectionleveldefault":      "Wählen Sie eine Fehlerkorrekturstufe aus",
    "iconsent":                        "Ich stimme der Aktivierung des Verlaufs zu",
    "inotconsent":                     "Ich stimme der Aktivierung des Verlaufs nicht zu",
    "addlogo":                         "Logo hinzufügen (PNG/JPG):",
    "sizeselect":                      "Größe in Pixel:",
    "marginselect":                    "Rand in Pixel:",
    "codecaptchatext":                 "CAPTCHA-Code:",
    "generatetext":                    "QR-Code generieren",
    "downloadqr":                      "QR-Code herunterladen",
    "oversizelogo":                    "Das Logo ist zu groß. Grenze: 2 MB.",
    "onlyjpgpng":                      "Nur PNG- oder JPG-/JPEG-Dateien sind erlaubt.",
    "captchacodetext":                 "Captcha:",
    "h2product":                       "StuQrGenerator",
    "pinfo1":                          "Suchen Sie nach einer einfachen und effizienten Möglichkeit, wichtige Informationen auf einen Blick zu teilen? StuQrGenerator macht es für Sie.",
    "pinfo2":                          "Mit seiner Benutzerfreundlichkeit und Vielseitigkeit ermöglicht Ihnen unser Tool, individuelle QR-Codes in wenigen Klicks zu erstellen.",
    "pinfo3":                          "Stellen Sie sich vor, Sie könnten sofort eine URL, einen Text, Kontaktdaten oder andere relevante Inhalte in einen QR-Code umwandeln.",
    "pinfo4":                          "StuQrGenerator vereinfacht diesen Prozess. Geben Sie einfach Ihre Daten ein, passen Sie Ihren Code nach Bedarf an (Fehlerkorrektur wählen, Logo hinzufügen, Größe auswählen usw.) und fertig! Innerhalb von Sekunden ist Ihr Code einsatzbereit.",
    "h2explain":                       "Funktionsweise",
    "pexplain1":                       "StuQrGenerator wurde mit Benutzerfreundlichkeit im Sinn konzipiert. Es bietet eine benutzerfreundliche Oberfläche, auf der Sie die Informationen eingeben, die Sie codieren möchten, sowie die Pixelgröße und den gewünschten Fehlerkorrektur-Level angeben.",
    "pexplain2":                       "Wenn der Fehlerkorrektur-Level ausreicht, können Sie sogar Ihre QR-Codes anpassen und ein Logo hinzufügen.",
    "pexplain3":                       "Nach Festlegung der Parameter kümmert sich StuQrGenerator um den Rest. Er erstellt Ihren QR-Code schnell und zuverlässig und gewährleistet Funktionalität und Lesbarkeit.",
    "pexplain4":                       "So erhalten Sie einen visuellen Code, der auf physischen Medien, Werbung, Veranstaltungen, Produkten oder anderen Elementen, die schnelle und intuitive Interaktion erfordern, verwendet werden kann.",
    "pexplain5":                       "Zusammenfassend bietet StuQrGenerator eine einfache, schnelle und effiziente Möglichkeit, Ihre Daten in interaktive visuelle Codes umzuwandeln.",
    "pexplain6":                       "Egal, ob für Marketingkampagnen, Events, Lagerverwaltung oder einfach zum einfachen Teilen von Informationen - unser Tool wurde entwickelt, um Ihre Anforderungen effizient und professionell zu erfüllen.",
    "historytitle":                    "Ihre früheren Generierungen:",
    "meetthedeveloper":                "Treffen Sie den Entwickler hier: ",
    "showmodalhistory":                "Aktivieren Sie die Aufzeichnung der generierten QR-Codes",
    "historicalConditionsTitle":       "Unsere Bedingungen für die Verwendung der Historie",
    "dearUser":                        "Lieber Nutzer,",
    "improveExperience":               "Um Ihre Erfahrung zu verbessern und es Ihnen zu ermöglichen, die von Ihnen generierten QR-Codes leicht wiederzufinden, möchten wir gerne lokal einen Verlauf Ihrer Erstellungen speichern. Dadurch haben Sie immer Zugriff auf Ihren persönlichen Verlauf von QR-Codes, wenn Sie unseren Service nutzen.",
    "implicationsTitle":               "Was bedeutet das?",
    "quickAccess":                     "Sie haben schnellen Zugriff auf Ihre zuvor generierten QR-Codes.",
    "noDataSharing":                   "Wir teilen diese Daten niemals ohne Ihre ausdrückliche Zustimmung mit Dritten, wir bitten nicht darum, da wir nichts mit Dritten teilen möchten.",
    "accessFromCurrentDevice":         "Ihre QR-Codes bleiben nur von dem Gerät aus zugänglich, das Sie aktuell verwenden.",
    "deletionAfter30Days":             "Die QR-Codes werden nach 30 Tagen in jedem Fall gelöscht, wir behalten keinen Verlauf.",
    "titleHistory":                    "QR-Code-Generator | Informationen zu Ihren persönlichen Daten",
    "download":                        "Herunterladen",
    "seeMore":                         "Mehr anzeigen",
    "lng1":                            "en",
    "lng2":                            "fr",
    "yourQrCode":                      "Ihr QR-Code",


    "altLng1":                         "Verwenden Sie den Generator auf Englisch",
    "altLng2":                         "Verwenden Sie den Generator auf Deutsch",
    "altStuQrLogo":                    "StuQrGenerator-Logo",
    "linkUsecase":                     "Verwenden Sie StuQrGenerator, um QR-Codes für Links zu generieren",
    "infosUsecase":                    "Verwenden Sie StuQrGenerator, um Informations-QR-Codes oder informativen Links zu generieren",
    "contactUsecase":                  "Verwenden Sie StuQrGenerator, um Kontakte über QR-Codes zu teilen",
    "menuUsecase":                     "Verwenden Sie StuQrGenerator, um einen Link zum Menü Ihres Restaurants zu teilen",
    "locationUsecase":                 "Verwenden Sie StuQrGenerator, um einen Standort, Koordinaten oder Kartenlinks zu teilen",
    "ticketsUsecase":                   "Verwenden Sie StuQrGenerator, um einen Link zu Ihrem Ticketverkauf zu teilen",
    "wifiUsecase":                     "Verwenden Sie StuQrGenerator, um Ihr WLAN zu teilen",
    "socialUsecase":                   "Verwenden Sie StuQrGenerator, um Ihre sozialen Netzwerke zu teilen"

}