{
    "lang":                            "en",
    "title":                           "QR Code Generator | Home",
    "h1title":                         "QR code generator",
    "err1":                            "Error: Unable to create the folder.",
    "err2":                            "Error: Chosen error correction is not correct.",
    "err3":                            "Error: Chosen QR code size is not correct.",
    "err4":                            "Error: Chosen QR code margin is not correct.",
    "err5":                            "Error: Margin is too large.",
    "err6":                            "Error: To use a logo, you must use a high correction level.",
    "err7":                            "Error: The logo you want to add must be perfectly square.",
    "qrgenok":                         "QR code generated successfully.",
    "fillall":                         "All form fields must be filled.",
    "badcaptcha":                      "Invalid CAPTCHA.",
    "badcsrf":                         "CSRF verification failed. The form cannot be processed.",
    "titleconsent":                    "Request for consent to store QR Codes.",
    "consentinfo1":                    "By checking the box above, you give us permission to locally store your QR Codes on your PC for personal use.",
    "consentinfo2":                    "If you do not wish us to do so, you can still generate QR Codes without storing history.",
    "consentinfo3":                    "Your privacy is important to us, and we thank you for helping us make our service tailored to your needs while respecting your privacy.",
    "consentinfo4":                    "More information here.",
    "formtxt":                         "Text or URL:",
    "formcorrectionlevel":             "Error correction level:",
    "formcorrectionleveldefault":      "Select a correction level",
    "iconsent":                        "I consent to enabling history",
    "inotconsent":                     "I do not consent to enabling history",
    "addlogo":                         "Add a logo png / jpg:",
    "sizeselect":                      "Size in pixels:",
    "marginselect":                    "Margin in pixels:",
    "codecaptchatext":                 "CAPTCHA code:",
    "generatetext":                    "Generate QR Code",
    "downloadqr":                      "Download QR Code",
    "oversizelogo":                    "Logo size too large. Limit: 2 MB.",
    "onlyjpgpng":                      "Only PNG or JPG / JPEG files are allowed.",
    "captchacodetext":                 "Captcha :",
    "h2product":                       "StuQrGenerator",
    "pinfo1":                          "Are you looking for a simple and effective way to share important information in the blink of an eye? StuQrGenerator does it for you.",
    "pinfo2":                          "With its ease of use and versatility, our tool allows you to create custom QR codes in just a few clicks.",
    "pinfo3":                          "Imagine being able to instantly turn a URL, text, contact information, or any other relevant content into a meaningful QR code.",
    "pinfo4":                          "StuQrGenerator simplifies this process. Just enter your data, customize your code according to your needs (choice of error correction, adding logos, selecting size, etc.), and voila! In moments, your code is ready to use.",
    "h2explain":                       "How It Works",
    "pexplain1":                       "StuQrGenerator has been designed to be intuitive. It offers a user-friendly interface where you input the information you want to encode, its pixel size, and the desired error correction level.",
    "pexplain2":                       "If the correction level is sufficient, you can even customize your QR codes by adding a logo.",
    "pexplain3":                       "Once the settings are defined, StuQrGenerator takes care of the rest. It creates your QR code quickly and reliably, ensuring its functionality and readability.",
    "pexplain4":                       "You get a visual code ready to be shared on physical media, advertisements, events, products, or any other element requiring quick and intuitive interaction.",
    "pexplain5":                       "In summary, StuQrGenerator offers you a simple, fast, and effective way to transform your data into interactive visual codes.",
    "pexplain6":                       "Whether for a marketing campaign, an event, inventory management, or simply sharing information with ease, our tool is designed to meet your needs efficiently and professionally.",
    "historytitle":                    "Your Previous Generations:",
    "meetthedeveloper":                "Find the developer here: ",
    "showmodalhistory":                "Enable history of generated QR codes",
    "historicalConditionsTitle":       "Our terms of use for the history function",
    "dearUser":                        "Dear user,",
    "improveExperience":               "To enhance your experience and allow you to easily retrieve the QR codes you've generated, we would like to locally store a history of your creations. This means you'll have access to your personal history of QR codes every time you use our service.",
    "implicationsTitle":               "What does this imply?",
    "quickAccess":                     "You'll have quick access to your previously generated QR codes.",
    "noDataSharing":                   "We will never share this data with third parties without your explicit consent. We're not asking for it as we don't intend to share anything with third parties.",
    "accessFromCurrentDevice":         "Your QR codes will only be accessible from the device you are currently using.",
    "deletionAfter30Days":             "Everyone's QR codes are deleted after 30 days in any case; we do not keep the history.",
    "titleHistory":                    "QR Code Generator | Information Regarding Your Personal Data",
    "download":                        "Download",
    "seeMore":                         "See More",
    "lng1":                            "fr",
    "lng2":                            "de",
    "yourQrCode":                      "Your QR Code",

    
    "altLng1":                         "Use the generator in French",
    "altLng2":                         "Use the generator in German",
    "altStuQrLogo":                    "StuQrGenerator logo"

}
